tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "gmp"
brew "libyaml"
brew "readline"
brew "openssl@1.1"
brew "fzf"
brew "gh"
brew "git"
brew "global"
brew "nkf"
brew "ripgrep"
brew "starship"
brew "vim"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
# brew "awscli"

# cask "google-chrome"
# cask "google-japanese-ime"
# cask "alfred"
# cask "iterm2"
# cask "clipy"
# cask "postman"
# cask "hammerspoon"
# cask "visual-studio-code"
# cask "skitch"
# cask "coteditor"
# cask "figma"
# cask "zoom"
# cask "slack"

cask "coccinellida", args: { appdir: "/Applications" }
cask "docker", args: { appdir: "/Applications" }
cask "font-meslo-lg-nerd-font"
cask "postico", args: { appdir: "/Applications" }
cask "thunderbird", args: { appdir: "/Applications" }
